#+Title: Active Documents with Org-mode
#+Author:
#+LATEX_HEADER: \usepackage{attrib}
#+Options: ^:nil toc:nil

\begin{abstract}
  Reproducibility is essential to peer reviewed research, however,
  refereed scientific publications often lack the information required
  to reproduce the research and analysis described in the work.
  \begin{quote}
    An article about computational science in a scientific publication
    is not the scholarship itself, it is merely advertising of the
    scholarship.  The actual scholarship is the complete software
    development environment and complete set of instructions which
    generated the figures.
    \attrib{David L. Donoho}
  \end{quote}
  Org-mode is a simple plain text markup language for hierarchical
  documents allowing intermingled data, code and prose.  An entire
  research project including; initial note taking, planning and task
  management, experimentation, analysis and publication, may take
  place within a single Org-mode document.  This article introduces
  Org-mode including a overview of syntax, a working example of
  reproducible research, and motivation for the features which make
  Org-mode a particularly useful tool for the scientific researcher.
\end{abstract}

* Example Application
This example will show correlation of home team offensive statistics
with attendance for the src_sh[:var season=season]{echo $season}
season.

#+results: season
: 2010

This first simple code block translates the season into the url used
to grab the season statistics from http://www.retrosheet.org [fn:1].

#+source: url
#+begin_src sh :var season=season
  echo "http://www.retrosheet.org/gamelogs/gl$season.zip"
#+end_src

Next we grab the statistics, saving them to a local text file.  The
=:cache yes= header argument ensures that the code block is only run
once and the data is not downloaded multiple times.

#+source: raw-data
#+begin_src sh :cache yes :var url=url :file 2010.csv
  wget $url && \
      unzip -p gl2010.zip > 2010.csv && \
      rm gl2010.zip
#+end_src

#+results[5b2ff918c69c8588ceb2ff6b9f297e68c8a24e08]: raw-data
[[file:2010.csv]]

The next two code block should probably be combined into a single
python code block...  They return the names of the offensive
statistics which we will be testing for correlation.

#+source: stat-headers
#+begin_src sh :results output :cache yes
  curl http://www.retrosheet.org/gamelogs/glfields.txt \
      |head -74 \
      |tail -17 \
      |cut -c14- \
      |grep -v "^ " \
      |cut -d "." -f1 |cut -d "(" -f1
#+end_src

#+results[7d12e3d1647a593064f8551ea8b5e06ec094ced4]: stat-headers
#+begin_example
hits
doubles
triples
homeruns
RBI
sacrifice hits
sacrifice flies 
hit-by-pitch
walks
intentional walks
strikeouts
stolen bases
caught stealing
grounded into double plays
awarded first on catcher's interference
left on base
#+end_example

#+source: stat-headers-list
#+begin_src emacs-lisp :var headers=stat-headers :results list
  (split-string headers "\n")
#+end_src

#+results: stat-headers-list
- hits
- doubles
- triples
- homeruns
- RBI
- sacrifice hits
- sacrifice flies 
- hit-by-pitch
- walks
- intentional walks
- strikeouts
- stolen bases
- caught stealing
- grounded into double plays
- awarded first on catcher's interference
- left on base

This code block collects the offensive statistics from the raw data
file.

#+source: offensive-stats
#+begin_src sh :var file=raw-data
  cat $file \
      |awk '{for (x=50; x<=66; x++) {  printf "%s ", $x } print $18 }' FS=","
#+end_src

This code block uses the =R= statistical programming language to
calculate correlations.

#+source: analysis
#+begin_src R :var headers=stat-headers-list :var data=offensive-stats
  # apply the headers to the list
  
  # perform a simple correlation of each column with the attendence
  
  # return the name of the most correlated column

#+end_src

Then in some text in this portion of the example we can display the
name of the most correlated column using an inline code block.  The
home team offensive statistic most correlated with game attendance is
the src_sh[:var stat=analysis]{echo $stat}.

Using gnuplot we can plot histograms of the most correlated statistic
against the attendance, maybe doing something cute like using images
of baseball bats for the histogram bars...

#+begin_src gnuplot
  
#+end_src

Finally we mention that it is trivial for the reader of the paper not
only to re-run all of these calculations exactly as performed in the
original export of the data, but also to change the value of the
season at the beginning of the example, and to then re-run the
analysis on a new season.

